{
    "job_description": "Like Google's own ambitions, the work of a Software Engineer goes beyond just Search. Software Engineering Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of Engineers. You not only optimize your own code but make sure Engineers are able to optimize theirs. As a Software Engineering Manager you manage your project goals, contribute to product strategy and help develop your team. Teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nWith technical and leadership expertise, you manage engineers across multiple teams and locations, a large product budget and oversee the deployment of large-scale projects across multiple sites internationally.\n\nAs a part of the Workspace Monetization - Core Acquisition team, we own the self-serve signup and setup funnels for Workspace, a major business driver for all of Workspace and Cloud. We rapidly build, A/B test, and launch new features cross-functionally.\n\nAI will change the future of work in profound ways, and our products— Gmail, Docs, Drive, Calendar, Sheets, Vids and Meet are at the forefront. From pre-computed summaries for email threads, summaries for meetings, and videos created from a document using lifelike AI avatars, our AI opportunity is huge. Our mission is to meaningfully connect people so they can create, build, and grow together and as part of the team you can build how productivity tools should work 5-10 years into the future. You will work with model builders (Google DeepMind), work with exceptional leaders, and have the ability to impact billions of users across the world.\n\nResponsibilities\nBuild an effective and engaged team that feels supported by leadership and connected with each other.\nPartner with Product Manager, UX Design, UX Research, and Program Managers to plan, prioritize, and implement projects that drive measurable business growth for Workspace and Cloud.\nDevelop a culture of engineering and data practices to enable swift, effective decision-making in a rapidly-evolving business environment.\nMentor a group of engineers to help them get to the next stage of their career trajectory.\nCollaborate with other Workspace application teams to reach users where they are.",
    "job_title": "Engineering Manager, Acquisition and Onboarding",
    "job_location": "Sunnyvale, CA, USA; San Francisco, CA, USA",
    "job_salary": "$197,000-$291,000",
    "job_requirements": [
        "Bachelor's degree or equivalent practical experience",
        "8 years of experience in software development",
        "5 years of experience with design and architecture and testing/launching software products",
        "3 years of experience in a technical leadership role",
        "2 years of experience in a people management or team leadership role",
        "Master’s degree or PhD in Engineering, Computer Science, or a related technical field",
        "8 years of experience with data structures/algorithms",
        "5 years of experience in a technical leadership role leading project teams and setting technical direction",
        "3 years of experience working in a complex, matrixed organization involving cross-functional, or cross-business projects"
    ],
    "programming_languages": [
        "Java",
        "TypeScript"
    ],
    "frameworks": [],
    "tools": []
}